
{
"projects": [
{"image":"assets/imgs/monprospecteur-funnel.png", "text":"This is a worth sharing feature I have developed for the app Monpropecteur. This is a fully working CRM funnel, it works almost like a trello but especifically to help keeping everything up-to-date when there are multiple customers.<br> It uses a drag-n-drop system along with reordering of columns based on a priority algorithm, all columns and rows are editable and movable.","title":"Monprospecteur Funnel System"},
{"image":"assets/imgs/monprospecteur.png", "text":"I jumped on board of the Monprospecteur team on august of 2018. This is a company that offers both desktop and mobile versions of a tool that offers control over real-state auctions and postings. <br> My work here consists of implementing new features on both Ionic and the Angular versions. There is also server that runs on Nodejs, which I am also responsible for developing new features.","title":"Monprospecteur"},
{"image":"assets/imgs/freelancer-platinum.png", "text":"On november of 2018, I have received an upgrade on my Workana (biggest south-american freelancer website) account and have become a platinum freelancer, after completing and fixing many projects.","title":"Workana Platinum Status"},
{"image":"assets/imgs/kratRace.png", "text":"The beginning of 2018, I started a gig on fiverr to work on Unity games. It went well, the amount of time required to answer questions and get everything setup was not worth it for me, still a lot of fun projects. <br> The picture is from a racing game, where I have to redesign the AI and sterring system.","title":"Fiverr Unity Gig"},
{"image":"assets/imgs/olm_screen.png", "text":"My work on this app consists of constantly implement new solutions to the changing trends. The app is very up to date and uses AngularJS as its front-end and a php back-end server. The server side has been re-written a couple of times, the newest iteration it takes cares of the whole server using a single Node.js server which does all the I/O for the user files.","title":"Online Logo Maker"},
{"image":"assets/imgs/loginSogo.jpg",  "text":"Created a Login screen using Angular 5 and a quick Nodejs Backend. This was later implemented on a company, it works well.","title":"Sogo login screen"},
{"image":"assets/imgs/galaxy.jpg",     "text":"Created a top-down space shooter for Android and iOs. I got some of the artwork from a friend and the coding was all done in Unity. I really enjoyed learning Unity and have landed a couple of jobs with the foundations I learned here.","title":"A Galaxy Escape"},
{"image":"assets/imgs/contador_de_palavras.png",  "text":"One of my first websites, it works as a word counter and word repeat checker. The website has various users that come from google search","title":"<a href='http://contadordepalavras.com' target='_blank'>contadordepalavras.com</a>"},
{"image":"assets/imgs/agario.jpg",     "text":"Uploaded a small Agario server to a test Heroku App. I have modified it a little bit but not much, it will come!","title":"AgarIO Private Server"},
{"image":"assets/imgs/Patagonia.jpg",  "text":"I received a proposal to work in Montevideo on a game development company, I stayed there for 2 years working on 12 different games using Canvas and an JS API called CraftyJS, that also included a backend using Java, I started as a junior developer and got up to mid-senior.","title":"Patagonia Entertaiment"},
{"image":"assets/imgs/fov.jpg",        "text":"Fight for Valhalla is a rapid-paced 3rd person hack-n-slash that takes place in Helheim, the “hell” of Nordic Mythology. You play as Vigarr, a Viking who died an unworthy death and must now prove himself by fighting waves of skeletons, giants, and more to prove he is worthy of Valhalla. My main work was on AI and animations.","title":"Fight For Valhalla"}
]
}